CRIS67/CoupeDeFrance2019/Programmation/dsPIC/CoupeDeFrance2019.X/main.c
/*
 * File:   main.c
 * Author: Quentin BOYER
 *
 * Created on September 18, 2017, 6:59 PM
 */

#include "constant.h"



#include <xc.h>
#include <math.h>
#include <p33EP512GM310.h>
#include <stdint.h>
#include "clock.h"
#include "GPIO.h"
#include "timer.h"
#include "PWM.h"
#include "QEI.h"
#include "PID.h"
#include "SPI.h"
#include "ADC.h"
#include "UART.h"
#include "interrupt.h"
#include "US.h"
#include "AX12.h"
#include "DMA.h"

void testAccMax();
void reglageDiametre();
void straightPath(double cx, double cy, double ct, double speedMax, double accMax);
void go(double cx, double cy, double speedMax, double accMax);
void goBack(double cx, double cy, double speedMax, double accMax);
void turn(double ct);
void turnNOLIMIT(double ct);

void modif_straightPath(double arg_cx, double arg_cy, double arg_ct, double arg_speedMax, double accMax);

void test();
void test2();
void testPWM();
void testSPI();
void testADC();
void testInterrupt();
void testDelay();
void setMotLin(uint8_t state);
double readAdcLowPass(uint8_t channel, uint16_t nbSamples, double coefLP);
double readAdcMean(uint8_t channel, uint16_t nbSamples);
void setMotLin(uint8_t state);
double readAdcLowPass(uint8_t channel, uint16_t nbSamples, double coefLP);
//Global variables
//char TX[TX_SIZE];
char RX[RX_SIZE];
char unsigned TX_i;
char unsigned RX_i;
/*Current position*/
volatile long double x;
volatile long double y;
volatile long double theta;
/*Current setpoint position*/
volatile long double xc;
volatile long double yc;
volatile long double thetac;
/*Final setpoint position*/
volatile long double xf;
volatile long double yf;
volatile long double tf;

uint8_t finalPoint = 1;

volatile PID pidSpeedLeft, pidSpeedRight, pidDistance, pidAngle;
int state = 0;
int R,L;

//volatile char arrived;
//volatile char arrived_2;

extern volatile char   US_ON[NB_US];
extern volatile char   US_R[NB_US];
extern volatile double US[NB_US];

volatile char sendBT = 0;

extern volatile double receivedX,receivedY,receivedTheta;
extern volatile unsigned char newPosReceived;
extern volatile unsigned char newPosBackReceived;
extern volatile unsigned char newAngleReceived;
extern volatile unsigned char back;

extern volatile unsigned char debugPosRpi;

volatile unsigned char stop = 1;

unsigned char detectUS = 0;
unsigned char sensDetectUS = 1;

extern double var_ACC_MAX;

// <editor-fold defaultstate="collapsed" desc="Génération de trajectoire">
extern unsigned char statePathGeneration;
extern unsigned char stateTrap;

extern double cx, cy, ct;

extern double sign;

extern double phi;
extern double angle;

extern double theta0;
extern double angularVelocity;
extern double prevAngularVelocity;
extern double maxAngularVelocity;

extern double AngularAcceleration;

extern double angle1;


extern double dx;
extern double dy;
extern double alpha;

extern double totalDistance;
extern double dist;

extern double y_0;
extern double x_0;
extern double speed;
extern double precSpeed;

extern double acc;
extern double speedMax;

extern double dist1; // </editor-fold>

extern uint8_t BufferA[8];
extern volatile uint8_t RxDMABuffer[RX_DMA_SIZE];
extern uint16_t start;

extern uint16_t iD2,iF2;

volatile uint8_t verbose = 0;

volatile double funSpeed = 1000;
volatile double funAcc = 1000;

volatile double funAngularSpeed = 10;
volatile double funAngularAcc = 1;

volatile long double linSpeed = 0; //mm/s
volatile long double linAcc = 0; //mm/s^2
volatile long double rotSpeed = 0; //rad/s
volatile long double rotAcc = 0; //rad/s^2

int sens = 0;


volatile long double kahanErrorX;
volatile long double kahanErrorY;
volatile long double kahanErrorT;

volatile uint8_t arrived = 1;

int main(){
    int o;
    TRISFbits.TRISF7 = 0;
    LATFbits.LATF7 = 1;
    for (o = 0; o < 10000; o++);
    LATFbits.LATF7 = 0;
    for (o = 0; o < 10000; o++);
    LATFbits.LATF7 = 1;
    for (o = 0; o < 10000; o++);
    LATFbits.LATF7 = 0;
    for (o = 0; o < 10000; o++);
    LATFbits.LATF7 = 1;
    for (o = 0; o < 10000; o++);
    LATFbits.LATF7 = 0;
    for (o = 0; o < 10000; o++);
    
    initClock(); //Clock 140 MHz
    initGPIO();
    initPWM();
    initQEI();
    initDMA();
    initUART();
    initAX12();
    initInt();
    initUS();
    initADC();
    initSPI();
    
    
    x = 0;
    y = 0;
    theta = 0;
    
    xc = 0;
    yc = 0;
    thetac = 0;
    
    xf = 0;
    yf = 0;
    tf = 0;
    
    TX_i = 0;
    RX_i = 0;
    
    R = 0;
    L = 0;
    
    //double i;
    // <editor-fold defaultstate="collapsed" desc="Start">
    /*
     * LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0;
    for (i = 0; i < 10000; i++);
    LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0;
    for (i = 0; i < 10000; i++);
    LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0;
    for (i = 0; i < 10000; i++);
    LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0; */
    // </editor-fold>

    
    /*POS1CNTL = 0x8000;
    POS2CNTL = 0x8000;*/
    POS1CNTL = 0x0000;
    POS2CNTL = 0x0000;
    testSendToMotor(0, 0);
    initAllPID(&pidSpeedLeft, &pidSpeedRight, &pidDistance, &pidAngle);
    initTimer();
    //IEC0bits.T1IE = 0;  //stop asserv
    //sendToMotor(8,0);
    double oldCurrent = 0;
    double coefLP = 0.01;
    double oldCurrent2 = 0;
    //testSendToMotor(2, 2);
    x = 1000;
    y = 1500;
    theta = PI;
    
    xc = x;
    yc = y;
    thetac = theta;
    
    xf = x;
    yf = y;
    tf = theta;
    while(1){
        /*double current;
        double current2;
        uint16_t cnt;
        for(cnt = 0; cnt < 500;cnt++){
            int mes = readADC(ADC_CHANNEL_I_PUMP);
            current = mes;
            current = oldCurrent + (current - oldCurrent)*coefLP;
            oldCurrent = current;
            //delay_us(100);
        }
        for(cnt = 0; cnt < 500;cnt++){
            int mes = readADC(ADC_CHANNEL_I_ASS_1);
            current = mes;
            current = oldCurrent2 + (current - oldCurrent2)*coefLP;
            oldCurrent2 = current;
            //delay_us(100);
        }
        
        if(current < 40){
            LED_0 = 1;
        }
        else{
            LED_0 = 0;
        }
        
        if(current < 50){
            LED_1 = 1;
        }
        else{
            LED_1 = 0;
        }
        
