CRIS67/CoupeDeFrance2019/Programmation/dsPIC/CoupeDeFrance2019.X/main.c
        if(current < 100){
            LED_2 = 1;
        }
        else{
            LED_2 = 0;
        }*/
        delay_ms(10);
        LED_PLATINE = !LED_PLATINE;
        CheckMessages();
        //sendPos();
        sendPosLongDouble();
        if(newPosReceived){
                if(0){
                    
                    newPosReceived = 0;
                    
                    double angularVelocity = 0;
                    double maxAngularVelocity = funAngularSpeed;
                    double AngularAcceleration = funAngularAcc;
                    double angle = 0;
                    theta0 = theta;
                    double prevAngularVelocity = 0;
                    double phi = 20*PI;
                    double sign = 1;
                    if(sens == 0){
                        sign = -1;
                        sens = 1;
                    }
                    else{
                        sign = 1;
                        sens = 0;
                    }
                    finalPoint = 0; 
                            while(angularVelocity < maxAngularVelocity && angle < phi/2){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            double angle1 = angle;
                            while(angle < phi - angle1){
                                angle += TE * angularVelocity;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            AngularAcceleration = -AngularAcceleration;
                            while(angularVelocity > 0 && angle < phi){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                    finalPoint = 1;
                    
                }
                else{
                    statePathGeneration = 42;
                    delay_ms(100);
                    newPosReceived = 0;
                    if(newPosBackReceived)
                    {
                        newPosBackReceived = 0;
                        //printRpi(("DEBUG goBack main 1\n"));
                        goBack(receivedX,receivedY,2000,200);
                        //printRpi(("DEBUG goBack main 2\n"));
                    }
                    else{
                        //go(receivedX,receivedY,2000,200);
                        //go(receivedX,receivedY,1000,100);
                        modif_straightPath(receivedX,receivedY,0,funSpeed,funAcc);
                        //modif_straightPath(receivedX,receivedY,0,1000,100);
                    }
                }
            }
            if(newAngleReceived){
                if(1){
                    newAngleReceived = 0;
                    
                    double angularVelocity = 0;
                    double maxAngularVelocity = funAngularSpeed;
                    double AngularAcceleration = funAngularAcc;
                    double angle = 0;
                    theta0 = theta;
                    double prevAngularVelocity = 0;
                    //double phi = 20*PI;
                    double phi = receivedTheta - theta;
                    double sign = 1;
                    if(phi < 0){
                        sign = -1;
                        phi = -phi;
                    }
                    finalPoint = 0; 
                            while(angularVelocity < maxAngularVelocity && angle < phi/2){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            double angle1 = angle;
                            while(angle < phi - angle1){
                                angle += TE * angularVelocity;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            AngularAcceleration = -AngularAcceleration;
                            while(angularVelocity > 0 && angle < phi){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                    finalPoint = 1;
                }
                else if(0){
                    newAngleReceived = 0;
                    turn(receivedTheta);
                }
                else{
                    newAngleReceived = 0;
                    
                    double angularVelocity = 0;
                    double maxAngularVelocity = funAngularSpeed;
                    double AngularAcceleration = funAngularAcc;
                    double angle = 0;
                    theta0 = theta;
                    double prevAngularVelocity = 0;
                    //double phi = 20*PI;
                    double phi = receivedTheta - theta;
                    double sign = 1;
                    if(sens == 0){
                        sign = -1;
                        sens = 1;
                    }
                    else{
                        sign = 1;
                        sens = 0;
                    }
                    finalPoint = 0; 
                            while(angularVelocity < maxAngularVelocity && angle < phi/2){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            double angle1 = angle;
                            while(angle < phi - angle1){
                                angle += TE * angularVelocity;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                            AngularAcceleration = -AngularAcceleration;
                            while(angularVelocity > 0 && angle < phi){
                                angularVelocity += AngularAcceleration * TE;
                                angle += TE * (prevAngularVelocity + angularVelocity) / 2;
                                thetac = theta0 + angle * sign;
                                prevAngularVelocity = angularVelocity;
                                delay_ms(TE * 1000);
                            }
                    finalPoint = 1;
                }
                
