CRIS67/CoupeDeFrance2019/Programmation/dsPIC/CoupeDeFrance2019.X/main.c
}
void modif_straightPath(double arg_cx, double arg_cy, double arg_ct, double arg_speedMax, double accMax){
    /*INIT*/
    
    cx = arg_cx;
    cy = arg_cy;
    ct = arg_ct;
    
    speedMax = arg_speedMax;
    
    double thetaRobotPoint = atan2(cy-y,cx-x);
    phi = thetaRobotPoint - theta;
    while(phi < -PI)
        phi += 2*PI;
    while(phi > PI){
        phi -= 2*PI;
    }
    /*Phase 1 : rotation */
    xf = x;
    yf = y;
    tf = theta;
    finalPoint = 0;
    theta0 = theta;
    AngularAcceleration = funAngularAcc;
    maxAngularVelocity = funAngularSpeed;
    /*AngularAcceleration = 1;
    maxAngularVelocity = 10;*/
    angularVelocity = 0;
    prevAngularVelocity = 0;
    angle = 0;
    
    if(phi > 0)
        sign = 1;
    else{
        sign = -1;
        phi = -phi;
    }
    
    if(speedMax < 0)
        speedMax = 0;
    else if(speedMax > SPEED_MAX)
        speedMax = SPEED_MAX;
    if(accMax < 0)
        accMax = 0;
    else if(accMax > ACCELERATION_MAX)
        accMax = ACCELERATION_MAX;
    
    acc = accMax;
	speed = 0;
	precSpeed = 0;
	dist = 0;

    statePathGeneration = 1;
    stateTrap = 1;
}
void turnNOLIMIT(double ct){
    //double thetaRobotPoint = atan2(cy-y,cx-x);
    double phi = ct - theta;
    /*Phase 1 : rotation */
    xf = x;
    yf = y;
    tf = theta;
    double theta0 = theta;
    double AngularAcceleration = 3;//1;//10; envoie du steak
    double maxAngularVelocity = 10;//1;//10;
    double angularVelocity = 0;
    double prevAngularVelocity = 0;
    double angle = 0;
    
    double sign;
    if(phi > 0){
        sign = 1;
    }
    else{
        sign = -1;
        phi = -phi;
    }
    while(angularVelocity < maxAngularVelocity && angle < phi/2){
		angularVelocity += AngularAcceleration * TE;
		angle += TE * (prevAngularVelocity + angularVelocity) / 2;
        thetac = theta0 + angle * sign;
        prevAngularVelocity = angularVelocity;
		delay_ms(TE * 1000);
	}
    double angle1 = angle;
    while(angle < phi - angle1){
		angle += TE * angularVelocity;
        thetac = theta0 + angle * sign;
        prevAngularVelocity = angularVelocity;
		delay_ms(TE * 1000);
	}
    AngularAcceleration = -AngularAcceleration;
    while(angularVelocity > 0 && angle < phi){
		angularVelocity += AngularAcceleration * TE;
		angle += TE * (prevAngularVelocity + angularVelocity) / 2;
        thetac = theta0 + angle * sign;
        prevAngularVelocity = angularVelocity;
		delay_ms(TE * 1000);
	}
    thetac = theta0 + phi*sign;
    /*arrived = 0;
    while(!arrived){
        printPos();
    }*/
 
    delay_ms(500);
    
}
void testPIDs(){
    while(1){
        
        x = 0;
        y = 0;
        theta = 0;
        xc = x;
        yc = y;
        thetac = theta;
        xf = x;
        yf = y;
        tf = theta;
        
        while(stop);
        
        modif_straightPath(300,300,0,1000,100);
        
    }
}
void setMotLin(uint8_t state){
    double acc = 5;     //v/s^1
    double speed = 15;   //v
    double dt = 0.01;   //s
    
    double voltage = 0;
    
    unsigned long t1 = millis();
    if(state == 0){ //out
        while(!RUPT_ACT_0){ //wait for rupt
            if( (millis() - t1) > (dt*1000) ){
                if(voltage < speed){
                    voltage += acc*dt;
                    if(voltage > speed){
                        voltage = speed;
                    }
                    motorVoltage(ID_MOTOR_LINEAR,voltage);
                }
                
        //plot(1,(uint32_t)((int32_t)(readAdcLowPass(ADC_CHANNEL_I_PUMP,200,0.005))));
        //plot(1,(uint32_t)((int32_t)(readAdcMean(ADC_CHANNEL_I_PUMP,100))));
        //plot(2,(uint32_t)((int32_t)(readAdcMean(ADC_CHANNEL_I_ASS_1,100))));
            }
        }
        motorVoltage(ID_MOTOR_LINEAR,-voltage); //brake
        delay_ms(80);
        motorVoltage(ID_MOTOR_LINEAR,0);    //stop
    }
    else if(state == 1){ //in
        uint8_t nbCurrent = 0;
        while(!RUPT_ACT_1 && nbCurrent < 10){ //wait for rupt
            if( (millis() - t1) > (dt*1000) ){
                if(voltage > -speed){
                voltage -= acc*dt;
                if(voltage < -speed){
                    voltage = -speed;
                }
                motorVoltage(ID_MOTOR_LINEAR,voltage);
                }
                //plot(1,(uint32_t)((int32_t)(readAdcLowPass(ADC_CHANNEL_I_PUMP,100,0.1))));
        //plot(1,(uint32_t)((int32_t)(readAdcMean(ADC_CHANNEL_I_PUMP,100))));
        //plot(1,(uint32_t)((int32_t)(readAdcLowPass(ADC_CHANNEL_I_PUMP,200,0.005))));
        //plot(2,(uint32_t)((int32_t)(readAdcMean(ADC_CHANNEL_I_ASS_1,100))));
            }
            double current = readAdcLowPass(ADC_CHANNEL_I_PUMP,100,0.01);
            if(current > 30 && current < 40)
                nbCurrent++;
            else
                nbCurrent = 0;
            plot(1,(uint32_t)((int32_t)(current)));
        }
        motorVoltage(ID_MOTOR_LINEAR,-voltage); //brake
        delay_ms(80);
        motorVoltage(ID_MOTOR_LINEAR,0);    //stop
    }
    
}
double readAdcLowPass(uint8_t channel, uint16_t nbSamples, double coefLP){
	double oldCurrent = 0;
    double current;
	uint16_t cnt;
	for(cnt = 0; cnt < nbSamples;cnt++){
		int mes = readADC(channel);
		current = mes;
		current = oldCurrent + (current - oldCurrent)*coefLP;
		oldCurrent = current;
	}
	return current;
}
double readAdcMean(uint8_t channel, uint16_t nbSamples){
	double tot = 0;
	uint16_t cnt;
	for(cnt = 0; cnt < nbSamples;cnt++){
		int mes = readADC(channel);
        tot += mes;
	}
	return tot / nbSamples;
}